//29. Написать программу вычисления произведения чисел от 1 до N

int N=5;
int F=1;
for(int i=1;i<=N;i++)
{
    F=F*i;
}
Console.WriteLine(F);