// 5. Написать программу вычисления значения функции y=f(a)

double Y(double x)
{
    return x*x;
}
Console.WriteLine(Y(2));